<template>
  <section id="services" class="section-container section-content">
    <h3 class="my-text-xl">Наши услуги</h3>

    <div class="grid grid-cols-1 gap-[32px] xl:grid-cols-2 2xl:grid-cols-3">
      <ui-card-collapse v-for="card in cards" :key="card.title" v-bind="card">
        <p v-for="item in card.content" :key="item">{{ item }}</p>
      </ui-card-collapse>
    </div>
  </section>
</template>

<script setup lang="ts">
import type { CardCollapseProps } from '~/components/ui/card-collapse.vue'

const cards: (CardCollapseProps & { content: string[] })[] = [
  {
    title: 'Государственные информационные системы',
    srcIcon: '/images/services/airplay-video.svg',
    content: [
      '— Разработка проектной документации',
      '— Разработка системы и поиск продуктов, отвечающих требованиям',
      '— Внедрение системы с вовлечением пользователей',
      '— Техническая поддержка системы и ее обновление',
    ],
  },
  {
    title: 'Стратегия цифровой трансформации',
    srcIcon: '/images/services/airplay-audio.svg',
    content: [
      '— Разработка проектной документации',
      '— Разработка системы и поиск продуктов, отвечающих требованиям',
      '— Внедрение системы с вовлечением пользователей',
      '— Техническая поддержка системы и ее обновление',
    ],
  },
  {
    title: 'Портальные решения для государства и бизнеса',
    srcIcon: '/images/services/copy.svg',
    content: [
      '— Разработка проектной документации',
      '— Разработка системы и поиск продуктов, отвечающих требованиям',
      '— Внедрение системы с вовлечением пользователей',
      '— Техническая поддержка системы и ее обновление',
    ],
  },
  {
    title: 'Бизнес-анализ компании',
    srcIcon: '/images/services/newspaper.svg',
    content: [
      '— Разработка проектной документации',
      '— Разработка системы и поиск продуктов, отвечающих требованиям',
      '— Внедрение системы с вовлечением пользователей',
      '— Техническая поддержка системы и ее обновление',
    ],
  },
  {
    title: 'BI-аналитика',
    srcIcon: '/images/services/computing.svg',
    content: [
      '— Разработка проектной документации',
      '— Разработка системы и поиск продуктов, отвечающих требованиям',
      '— Внедрение системы с вовлечением пользователей',
      '— Техническая поддержка системы и ее обновление',
    ],
  },
  {
    title: 'Разработка программных продуктов и мобильных приложений',
    srcIcon: '/images/services/devices.svg',
    content: [
      '— Разработка проектной документации',
      '— Разработка системы и поиск продуктов, отвечающих требованиям',
      '— Внедрение системы с вовлечением пользователей',
      '— Техническая поддержка системы и ее обновление',
    ],
  },
  {
    title: 'Консультационные услуги по внедрению IT-стратегии',
    srcIcon: '/images/services/command.svg',
    content: [
      '— Разработка проектной документации',
      '— Разработка системы и поиск продуктов, отвечающих требованиям',
      '— Внедрение системы с вовлечением пользователей',
      '— Техническая поддержка системы и ее обновление',
    ],
  },
]
</script>

<style scoped></style>
